export type ChurchInfo = {
  no: number;
  name: string;
  pastor: string;
  elder: string;
  address: string;
  phone: string;
};

export type DistrictInfo = {
  name: string;
  count: string;
  leader: string;
  secretary: string;
  treasurer: string;
  churches?: ChurchInfo[];
  pendingImage?: boolean;
};

export const DISTRICTS_DATA: DistrictInfo[] = [
  {
    name: "강남시찰",
    count: "5당회",
    leader: "신규갑",
    secretary: "남궁현우",
    treasurer: "남궁현우",
    churches: [
      { no: 1, name: "제일성도", pastor: "이훈창, 신현철, 서지원, 권 율, 임정남, 장영진, 김우람, 성경훈", elder: "주영석, 김동호, 윤규현, 이주환", address: "서울 관악구 복은길 76 (08834)", phone: "교회 02-886-4111-5, Fax 02-871-8357, HP 010-9194-0691" },
      { no: 2, name: "영진", pastor: "유성훈, 김성수, 김동훈B, 이은일", elder: "김종명, 김진우", address: "서울 관악구 인헌7길 8 (08795)", phone: "교회 02-871-1151-2, Fax 02-871-1153, HP 010-2968-5025" },
      { no: 3, name: "생명샘", pastor: "최기남", elder: "", address: "서울 관악구 난곡로 26나길 47 B02호(08856)", phone: "교회 010-9459-4596" },
      { no: 4, name: "행복을여는", pastor: "신규갑", elder: "천경현", address: "경기 고양시 일산서구 일청로59번길 4 (10346)", phone: "교회 031-976-4101, 자택 031-976-4103, HP 010-8231-0146" },
      { no: 5, name: "구례읍", pastor: "장천규", elder: "", address: "전남 구례군 구례읍 택지1길 28-13 (57648)", phone: "자택 061-781-0255, Fax 061-781-0255, HP 010-3390-3516" },
      { no: 6, name: "용인성도", pastor: "방승훈", elder: "", address: "경기 용인시 처인구 동부로5번길 5 (17145)", phone: "교회 031-337-2679, 자택 031-338-2679, HP 010-8263-0191" },
      { no: 7, name: "산성", pastor: "정인걸", elder: "", address: "서울 관악구 국회단지11길 6 (08713)", phone: "교회 02-871-5836, HP 010-3801-5836" },
      { no: 8, name: "성공중앙", pastor: "성백송", elder: "", address: "서울 구로구 가마산로 97 현대로얄A 212호(08327)", phone: "교회 02-839-0536, HP 010-5241-1202" },
      { no: 9, name: "서울에스라", pastor: "남궁현우, 이 한, 김효종, 김수관", elder: "양호상", address: "서울 영등포구 양평동4가 31-3번지 샬록디아망타워 지하1층 101호(07212)", phone: "교회 02-581-3927, 자택 070-8844-1754, HP 010-3927-1754" },
      { no: 10, name: "수지행복한", pastor: "고승택", elder: "", address: "경기도 용인시 수지구 신봉1로 301번지길 5(2층)(16803)", phone: "교회 032-255-0093, HP 010-6347-6246" },
      { no: 11, name: "에스라소망", pastor: "김원주", elder: "", address: "경기 성남시 분당구 백현로97 수내동다운타운 1206호(13595)", phone: "HP 010-3756-8528" },
      { no: 12, name: "비전기도처", pastor: "김지상", elder: "", address: "경기 과천시 장군마을1길 25 (13818)", phone: "교회 02-888-4394, HP 010-3003-4394" },
      { no: 13, name: "유어", pastor: "김남현", elder: "", address: "인천 계양구 아나지로 332 201-211 (21119)", phone: "HP 010-9278-0416" }
    ]
  },
  {
    name: "강서시찰",
    count: "7당회",
    leader: "임창일",
    secretary: "정신조",
    treasurer: "장경헌",
    churches: [
      { no: 1, name: "강서중앙", pastor: "장경헌, 임은수", elder: "박배윤, 도상구", address: "서울 양천구 월정로42길 7 (07903)", phone: "교회 02-2605-2007, HP 010-2417-5678, Fax 02-2608-0346" },
      { no: 2, name: "람원", pastor: "김수환, 오문식, 김정훈, 김바울, 백요한, 김도완, 이예성", elder: "박기봉, 임경구, 김종명B, 이화행", address: "서울 강서구 까치산로 160-4 (07656)", phone: "교회 02-2605-2513, Fax 02-2601-8211, 자택 02-2693-6041, HP 010-2508-9773" },
      { no: 3, name: "한서제일", pastor: "김희수, 박현욱, 임찬병", elder: "나종문, 김진구", address: "서울 양천구 화곡로4길 30 (07905)", phone: "교회 02-2605-6871, Fax 02-2697-1273, HP 010-2913-1691" },
      { no: 4, name: "소망", pastor: "정신조", elder: "조성수", address: "서울 양천구 남부순환로 502 (08039)", phone: "교회 02-2605-7082, HP 010-3455-8970" },
      { no: 5, name: "목동반석", pastor: "임창일", elder: "원임구, 이병구", address: "서울 양천구 목동동로 146 (08014)", phone: "교회 02-2654-5855, Fax 02-2649-7787, HP 010-8839-9116" },
      { no: 6, name: "사랑", pastor: "팽수태", elder: "", address: "서울 강서구 화곡로 231 3층 (07695)", phone: "교회 02-6104-9004, HP 010-5009-2031" },
      { no: 7, name: "공항제일", pastor: "정찬영", elder: "", address: "서울 강서구 까치산로14길 50-5 나동 202호(07677)", phone: "교회 070-4503-1170, HP 010-7227-3191" },
      { no: 8, name: "발산성석", pastor: "서성철", elder: "", address: "서울 강서구 강서로47라길 31 (07638)", phone: "교회 070-7536-5622, HP 010-7789-0622" },
      { no: 9, name: "동산", pastor: "한준희", elder: "양창국", address: "서울 강서구 강서로47길 158 상가동 지층(07634)", phone: "교회 02-2667-2250, HP 010-3260-2028" },
      { no: 10, name: "푸른숲", pastor: "윤병남", elder: "", address: "서울 강서구 초원로 85 2층(07606)", phone: "교회 02-2662-2014, HP 010-3669-3014" },
      { no: 11, name: "목자", pastor: "조원만", elder: "", address: "김포시 운양동 1305-1(김포대로1430) 리버에일 린의 뜰 604-1104호 (10073)", phone: "교회 031-990-2779, HP 010-3763-7070" },
      { no: 12, name: "성석", pastor: "임창일", elder: "손기수, 정도민", address: "서울 강서구 곰달래로47길 18(07749)", phone: "교회 010-8715-5124, Fax 0504-265-5124, HP 010-8839-9116" },
      { no: 13, name: "이음숲", pastor: "손성찬, 신승훈, 김우림", elder: "", address: "자택:서울시 강서구 공항대로 45길24 등촌현대 아파트1차108호 (07571)", phone: "HP 010-2751-0018" },
      { no: 14, name: "한사람", pastor: "서창희, 김현수", elder: "", address: "서울 관악구 봉천로 575 3층 (08792)", phone: "교회 010-3532-4072, HP 010-8901-9123" },
      { no: 15, name: "테리전원", pastor: "고충성", elder: "김병옥", address: "경기도 김포시 고촌읍 인향로 244번길 27", phone: "HP 010-2289-4048" },
      { no: 16, name: "화천에셀나무기도처", pastor: "장근연", elder: "", address: "강원도 화천군 화천읍 노신로 82-16, 동보빌리지 102동 303호", phone: "HP 010-5410-4730" }
    ]
  },
  {
    name: "경기시찰",
    count: "5당회",
    leader: "이창선",
    secretary: "전창선",
    treasurer: "심지형",
    churches: [
      { no: 1, name: "새하늘", pastor: "이창선", elder: "정권용", address: "경기 안성시 일죽면 주래본죽로 311-4 (17528)", phone: "교회 031-671-0191, HP 010-4102-6016" },
      { no: 2, name: "천산", pastor: "정건택", elder: "김덕규", address: "충남 천안시 동남구 풍세로 996-1 (31189)", phone: "교회 041-568-8364, Fax 041-568-8364, 자택 041-553-1678, HP 010-5403-8364" },
      { no: 3, name: "수지수정", pastor: "이현석, 황규현, 김석주, 박성민, 조재홍", elder: "양장섭", address: "경기 용인시 수지구 정평로 34-3 (16844)", phone: "교회 031-265-5091, Fax 031-265-8285, HP 010-3417-2713" },
      { no: 4, name: "갈릴리", pastor: "차기운", elder: "박태복", address: "경기 평택시 평택5로 271 롯데캐슬A 상가3층 (17881)", phone: "교회 031-657-0691, 자택 031-653-9748, HP 010-7752-7991" },
      { no: 5, name: "제자", pastor: "정훈성", elder: "", address: "경기 용인시 기흥구 신구로 48 (16971)", phone: "HP 010-9890-4772" },
      { no: 6, name: "초대", pastor: "전보경", elder: "전보일", address: "경기 용인시 기흥구 한보라 2로 14번길 14-6 (17081)", phone: "교회 031-216-7089, HP 010-4305-0675" },
      { no: 7, name: "선한이웃염광", pastor: "이성진", elder: "송임석", address: "경기 오산시 운암로 37 거성프라자 8층 (18133)", phone: "교회 070-4255-4024, 자택 070-8272-4024, HP 010-4599-4024" },
      { no: 8, name: "기쁜우리", pastor: "심지형", elder: "엄무용", address: "대전시 유성구 송림로56 하나빌딩4층 (34159)", phone: "교회 042-822-0210, HP 010-2715-0251" },
      { no: 9, name: "전하리", pastor: "전창선, 구금룡", elder: "", address: "서울 성북구 화랑로 27길 18(27772)", phone: "교회 070-4191-1886, HP 010-6511-1886" },
      { no: 10, name: "경사기도처", pastor: "정사무엘", elder: "", address: "경기 이천시 백사면 원적로 685번길 7 (17310)", phone: "HP 010-3927-0175" }
    ]
  },
  {
    name: "경동시찰",
    count: "4당회",
    leader: "박희돈",
    secretary: "송종호",
    treasurer: "박승운",
    churches: [
      { no: 1, name: "하늘뜻", pastor: "권장혁", elder: "안천수", address: "서울 광진구 아차산로 69길 32 (04983)", phone: "교회 02-444-8905, Fax 02-479-3292, HP 010-7453-9191" },
      { no: 2, name: "초원", pastor: "권장혁", elder: "김수영", address: "경기도 하남시 감일로102번지 27 감일중앙프라자 502 (13001)", phone: "교회 02-404-9953, 자택 02-404-2829, HP 010-3721-5554" },
      { no: 3, name: "성민", pastor: "양제헌, 이상호, 강준성, 박태성B", elder: "김창현", address: "경기 광주시 이배재로 367번길 16 (12765)", phone: "교회 031-763-1036, Fax 031-763-1038, HP 010-5473-0698" },
      { no: 4, name: "기쁨의", pastor: "박승운", elder: "", address: "경기 하남시 신장로 156 하남프라자 501호 (12969)", phone: "교회 031-796-0691, Fax 031-794-6343, HP 010-3325-9461" },
      { no: 5, name: "새터", pastor: "", elder: "", address: "경기 하남시 천현로 39번길 56 (12952)", phone: "교회 031-791-3925, 자택 031-791-3925, HP 010-7322-3925" },
      { no: 6, name: "편안한", pastor: "이철근", elder: "", address: "서울 강동구 상암로3길 18 (05241)", phone: "자택 070-8274-1767, HP 010-2906-1230" },
      { no: 7, name: "우리", pastor: "송종호", elder: "", address: "경기 광주시 장지3길 17 (12777)", phone: "교회 031-765-1152, HP 010-9380-3078" },
      { no: 8, name: "새예루살렘", pastor: "이기원", elder: "", address: "경기 광주시 오포읍 오포안로 282 (12790)", phone: "교회 031-766-6911, HP 010-2517-6911" },
      { no: 9, name: "은혜의", pastor: "황정수", elder: "", address: "경기 광주시 파발로 103 3층 (12756)", phone: "교회 031-761-6075, Fax 031-761-6075, HP 010-6232-6075" },
      { no: 10, name: "새물결", pastor: "박희돈, 임종철, 전병수", elder: "김봉호A", address: "경기도 하남시 하남대로 739번길 80 (12960)", phone: "교회 02-2678-1164, HP 010-3137-2642" },
      { no: 11, name: "도시선교", pastor: "변재훈", elder: "", address: "하남시 미사 강변 중앙로 198 번길29 미사 푸르지오시티 B동 217호 (12913)", phone: "교회 031-794-3588, HP 010-4478-5788" }
    ]
  },
  {
    name: "남부시찰",
    count: "2당회",
    leader: "남인경",
    secretary: "박태성",
    treasurer: "이선주",
    churches: [
      { no: 1, name: "신부산제일", pastor: "남인경", elder: "이원범", address: "부산 동래구 수안로 17 (47888)", phone: "교회 051-557-3170, Fax 051-557-1537, 자택 051-557-3173, HP 010-9327-0208" },
      { no: 2, name: "성빈", pastor: "이 홍", elder: "", address: "부산 수영구 광일로 6 (48247)", phone: "교회 070-7562-7593, Fax 051-863-7593, 자택 051-864-7593, HP 010-9446-7593" },
      { no: 3, name: "영광스러운", pastor: "이선주", elder: "", address: "경남 거제시 사등면 사곡2길 16 (53278)", phone: "자택 070-7504-2187, HP 010-6297-2117" },
      { no: 4, name: "도남갈릴리", pastor: "박태성A", elder: "김외갑", address: "경남 통영시 서송정 3길 16 (53073)", phone: "교회 055-648-3833, HP 010-7389-2579" },
      { no: 5, name: "벧엘", pastor: "김태순(전도사)", elder: "", address: "경북 경산시 하양읍 대곡로 519-69 (38406)", phone: "교회 053-851-9551, 자택 053-851-9551, HP 010-5234-0191" },
      { no: 6, name: "늘푸른기도처", pastor: "김영주A", elder: "", address: "경남 통영시 봉수2길 12-5 (53078)", phone: "교회 055-649-0667, HP 010-3566-8417" }
    ]
  },
  {
    name: "동부시찰",
    count: "3당회",
    leader: "김정일",
    secretary: "박상규",
    treasurer: "박인용",
    churches: [
      { no: 1, name: "양양송전", pastor: "김주석", elder: "", address: "강원 양양군 손양면 송평길 13-2 (25041)", phone: "교회 033-672-2501, HP 010-2780-2501" },
      { no: 2, name: "늘사랑", pastor: "강영하", elder: "곽희윤", address: "강원 평창군 봉평면 기풍로 198 (25303)", phone: "교회 033-336-2500, 자택 033-335-3536, Fax 033-334-2501, HP 010-9480-3200" },
      { no: 3, name: "사랑샘", pastor: "박상규", elder: "", address: "경기 남양주시 진접읍 봉현로 69 (12007)", phone: "교회 031-571-2561, HP 010-7733-7579" },
      { no: 4, name: "예본", pastor: "박종오", elder: "", address: "서울 노원구 광운로3길 5 4층 (01898)", phone: "교회 02-963-4925, HP 010-8776-4925" },
      { no: 5, name: "동해안중앙", pastor: "조용순", elder: "", address: "강원 강릉시 옥계면 풍동로 240-19 (25638)", phone: "교회 033-535-2814, HP 010-9744-2814" },
      { no: 6, name: "새중앙", pastor: "이은세", elder: "", address: "경기 성남시 수정구 공원로 343, 지1층 (13350)", phone: "교회 031-736-3927, HP 010-5212-3927" },
      { no: 7, name: "하이샬롬", pastor: "박인용", elder: "", address: "서울시 강동구 천호대로200길 15-13(둔촌동) (05358)", phone: "교회 02-432-7371-2, HP 010-3756-6477" },
      { no: 8, name: "영동", pastor: "탁정헌", elder: "마석홍", address: "경기 이천시 신둔면 원적로 434 (17300)", phone: "교회 031-633-0691, 자택 031-633-0695, HP 010-9666-6917" },
      { no: 9, name: "주함께", pastor: "김정일, 이정환, 임동건", elder: "최영식", address: "서울 송파구 백제고분로46길 3 2층 (05662)", phone: "교회 02-419-9101, HP 010-5281-2657" },
      { no: 10, name: "늘복된", pastor: "이재중", elder: "문기수", address: "서울 강동구 구천면로47길 47 2층 (05260)", phone: "교회 02-441-0644, Fax 02-441-0644, HP 010-3201-5198" },
      { no: 11, name: "임마누엘", pastor: "안춘전", elder: "김기섭", address: "서울 동대문구 무학로26길 30 신동아A 상가 3층 (02588)", phone: "교회 02-927-1319, Fax 02-922-1653, 자택 02-929-7134, HP 010-8266-1319" },
      { no: 12, name: "예문", pastor: "", elder: "", address: "경기 양주시 장흥면 권율로 51 푸른옥 A 상가 2층 (11520)", phone: "교회 031-826-9125, HP 010-9473-8125" },
      { no: 13, name: "샘솟는", pastor: "", elder: "", address: "경기 용인시 수지구 용구대로 2742 동성A 상가 3층 (16868)", phone: "교회 031-263-1463, HP 010-2790-2531" }
    ]
  },
  {
    name: "북부시찰",
    count: "5당회",
    leader: "이춘수",
    secretary: "김형관",
    treasurer: "최승환",
    churches: [
      { no: 1, name: "많은물", pastor: "황태성", elder: "박태수", address: "경기도 남양주시 경강로399번길 31-1(12246)", phone: "교회 031-576-6074, HP 010-9099-6075" },
      { no: 2, name: "동문", pastor: "최승한", elder: "김기용", address: "서울 도봉구 해등로 200-13 (01385)", phone: "교회 02-931-4497, 자택 02-954-4497, HP 010-7685-0191" },
      { no: 3, name: "목양", pastor: "김승하, 김하진", elder: "", address: "서울 노원구 중계로6가길 3 (01729)", phone: "교회 02-932-1861, 자택 02-932-1861, HP 010-9031-8701" },
      { no: 4, name: "한지붕", pastor: "김주한", elder: "", address: "경기 의정부시 신곡로 60 (11730)", phone: "교회 031-829-0190, 자택 031-829-0190, HP 010-8297-0190" },
      { no: 5, name: "서울", pastor: "이춘수", elder: "이관형", address: "서울 노원구 덕릉로 803 건영 A 상가 203호 (01638)", phone: "교회 02-3391-4772, Fax 02-931-4772, 자택 02-3391-4771, HP 010-3885-4772" },
      { no: 6, name: "벧엘", pastor: "김현관", elder: "나오균", address: "서울 강북구 삼양로19길109 삼각산아이원A 401동 지하층 (01198)", phone: "교회 02-989-5590, HP 010-6412-1495" },
      { no: 7, name: "돈암우리", pastor: "남태웅", elder: "정승열", address: "서울 성북구 북악산로15길 42 (02817)", phone: "교회 02-923-7582, Fax 02-922-2295, HP 010-7736-5839" }
    ]
  },
  {
    name: "서부시찰",
    count: "2당회",
    leader: "전수창",
    secretary: "이덕근",
    treasurer: "이덕근",
    churches: [
      { no: 1, name: "삼이삼", pastor: "장원철", elder: "", address: "경기도 성남시 수정구 위례광장로 36 4단지 A동 204호 (13646)", phone: "교회 02-2058-2636, 자택 070-7782-6654, HP 010-9144-6087" },
      { no: 2, name: "꿈이있는", pastor: "전수창", elder: "황운섭", address: "경기 부천시 장말로13 윤주빌딩 4층(14593)", phone: "교회 032-321-0051, HP 010-4421-0051" },
      { no: 3, name: "상록제일", pastor: "양병용", elder: "", address: "경기 안산시 상록구 본오로 31-4, 2층 (본오동) (15567)", phone: "교회 031-438-2234, Fax 031-502-9672, 자택 031-502-9673, HP 010-9447-3194" },
      { no: 4, name: "예일", pastor: "이덕근", elder: "", address: "인천 부평구 부평북로 433 삼산미래타운 1단지 상가 B1 (21319)", phone: "교회 032-201-7004, 자택 032-514-9077, HP 010-4746-9077" },
      { no: 5, name: "복된", pastor: "김인수", elder: "", address: "인천 연수구 함박로 4번길 57 (21913)", phone: "교회 032-432-0633, HP 010-7636-3927" },
      { no: 6, name: "예람", pastor: "정만석", elder: "", address: "경기 부천시 원미구 삼작로 292번길 21-18 (14483)", phone: "교회 032-346-3375, HP 010-7556-9120" },
      { no: 7, name: "행복한", pastor: "노은오", elder: "", address: "경기도 시흥시 군서마을로 60-1, 1층 (15052)", phone: "교회 031-498-7488, HP 010-8484-7488" },
      { no: 8, name: "낙원", pastor: "윤성욱, 배재선", elder: "조수용", address: "경기 광명시 시청로 34 (14234)", phone: "교회 02-855-0505, HP 010-3374-1868" },
      { no: 9, name: "영성", pastor: "신현우", elder: "이창희, 양국성", address: "경기 부천시 범안로 36번길 24 (14697)", phone: "교회 032-342-0191, Fax 032-348-0191, 자택 032-342-2210, HP 010-9491-8231" },
      { no: 10, name: "호산나", pastor: "장희규", elder: "", address: "경기도 시흥시 도일로 123번길4 대동빌딩401호(13646)", phone: "HP 010-2826-2891" },
      { no: 11, name: "드림", pastor: "김정헌", elder: "김학태", address: "경기 안산시 상록구 안산천동로 3길 24 (15282)", phone: "교회 031-411-8525, HP 010-4535-6029, FAX 050-4141-8840" }
    ]
  },
  {
    name: "중부시찰",
    count: "5당회",
    leader: "신하철",
    secretary: "김철회",
    treasurer: "김영주",
    churches: [
      { no: 1, name: "제일", pastor: "유광진, 정영선, 엄영석", elder: "백영재", address: "서울 서대문구 통일로 35길 59 (03646)", phone: "교회 02-379-9506, Fax 02-396-8088, HP 010-3729-8972" },
      { no: 2, name: "평강", pastor: "이현수, 박민성", elder: "위성진", address: "서울 은평구 갈현로5길 5-9 (03435)", phone: "교회 02-385-4015, 자택 02-385-4015, HP 010-9427-1738" },
      { no: 3, name: "동대문제일", pastor: "김영주, 김광명", elder: "임운석, 박민섭", address: "서울 종로구 보문로3길 24 (03111)", phone: "교회 02-926-9270, Fax 02-928-9420, HP 010-4661-3927" },
      { no: 4, name: "서울숲중앙", pastor: "신하철, 이철제, 김주현, 박신보, 봉진영", elder: "류호길, 송헌도", address: "서울 성동구 고산자로 8길 36 (04745)", phone: "교회 02-2292-9291, Fax 02-2292-9281, HP 010-5600-6093" },
      { no: 5, name: "일산좋은", pastor: "이봉근", elder: "", address: "경기 고양시 일산서구 대산로212번길 8-67 (10370)", phone: "교회 031-966-9791, HP 010-4267-6194" },
      { no: 6, name: "새마음", pastor: "김철회, 박종광", elder: "김봉호", address: "경기 광명시 가학동 407-2 (14340)", phone: "자택 02-2617-9819, HP 010-2817-9819" },
      { no: 7, name: "하울", pastor: "박형주", elder: "", address: "서울 구로구 고척로 1길 33 충정빌라 101호 (08266)", phone: "교회 02-2618-1118, HP 010-4776-4485" },
      { no: 8, name: "유구은혜", pastor: "신익균", elder: "", address: "충남 공주시 유구읍 신영새말길 46-4 (32502)", phone: "교회 041-841-1993, HP 010-4404-1993" },
      { no: 9, name: "생명의", pastor: "백규석", elder: "", address: "경기 파주시 청암로 27 산내마을 6단지 606-902 (10872)", phone: "교회 031-946-8601, 자택 031-948-8601, HP 010-6789-8601" },
      { no: 10, name: "사랑나눔", pastor: "최종태", elder: "", address: "경기 파주시 평화로 342번길 101 (10848)", phone: "교회 031-8070-6050, Fax 031-8070-6050, HP 010-3237-2259" },
      { no: 11, name: "진접움직이는", pastor: "박창근", elder: "", address: "경기 남양주시 진접읍 장현로 141, 2층(12006)", phone: "교회 031-528-5008, HP 010-2734-6882" }
    ]
  }
];
